{
    "fr": {
      "title": "Mon Portefolio",
      "headerTitle": "Mon Portefolio",
      "titleAboutMe": "À propos de moi",
      "aboutText": "Bonjour et bienvenue sur mon portfolio ! Je suis un étudiant en école d'ingénieur informatique en alternance passionné de technologie, à la recherche de nouvelles opportunités pour mettre en pratique mes compétences et développer mes connaissances. Au travers de ce portfolio, je partage mes projets, mes réalisations et mes expériences professionnelles, reflétant mon parcours. Explorez mon travail et découvrez comment j'ai pu contribuer à des projets concrets, acquérir de nouvelles compétences et relever des défis passionnants. Je suis ouvert aux collaborations et aux opportunités d'apprentissage, alors n'hésitez pas à me contacter si vous souhaitez en savoir plus sur mes réalisations ou discuter de projets potentiels. Merci de visiter mon portfolio et j'espère avoir l'occasion de collaborer avec vous.",
      "titleProject": "Mes projets",
      "contactTitle": "Contact",
      "languageButtonText": "Français",
      "name": "Mathieu MAION",
      "email": "mathieu.maion0@gmail.com",
      "phone": "06 15 80 45 34",
      "headerAboutMe": "À propos de moi",
      "headerProjects": "Projets",
      "headerPath": "Parcours",
      "headerSkills": "Compétences",
      "titlePath": "Mon parcours",
      "titleSkills": "Mes compétences",
      "pathInfoCESITitle": "CESI école d'ingénieurs",
      "pathInfoCESIFormation": "Ingénieur informatique en alternance",
      "pathInfoCESICity": "Vandœuvre-lès-Nancy, 6 Rue Bois du Chêne le Loup",
      "pathInfoCESIDesc": "Actuellement en formation d'ingénieur en informatique, je développe à la fois des compétences avancées en informatique et une expertise en travail d'équipe. En me spécialisant dans des domaines tels que la programmation, les réseaux et la sécurité informatique, j'acquiers une expertise technique approfondie. Parallèlement, les projets de groupe auxquels je participe me permettent d'améliorer mes compétences interpersonnelles, telles que la communication, la collaboration et la résolution de problèmes en équipe, des qualités essentielles pour réussir dans le domaine de l'ingénierie informatique.",
      "pathInfoIUTTitle": "IUT Nancy-Charlemagne",
      "pathInfoIUTFormation": "DUT informatique spécialité mathématique pour l'ingénieur",
      "pathInfoIUTCity": "Nancy, 2Ter Bd Charlemagne",
      "pathInfoIUTDesc": "La formation en DUT Informatique avec une spécialité en mathématiques pour l'ingénieur m'a permis de développer des compétences approfondies en informatique et de travailler de manière efficace en équipe. J'ai acquis une expertise dans des domaines tels que la programmation, les bases de données et la conception de logiciels, tout en collaborant avec mes pairs sur des projets concrets. Cette expérience m'a non seulement permis de renforcer mes compétences techniques, mais aussi de développer mes compétences en communication, en résolution de problèmes et en collaboration, qui sont essentielles dans le monde professionnel de l'informatique.",
      "pathInfoPoincareTitle": "Lycée Henri Poincaré",
      "pathInfoPoincareFormation": "Baccalauréat scientifique spécialité mathématique",
      "pathInfoPoincareCity":"Nancy, 2 rue de la visitation",
      "pathInfoPoincareDesc": "Cette formation m'a permis d'obtenir une capacité à travailler avec rigueur, à analyser des problèmes complexes et à utiliser des méthodes mathématiques pour résoudre des situations concrètes. Ces compétences m'ont été précieuses dans de nombreux domaines, tels que les sciences, l'ingénierie et l'informatique. ",
      "pathSkillsWeb": "Web",
      "pathSkillsProgrammingLanguages": "langages de programmation",
      "pathSkillsDB": "Base de données",
      "CVText": "Mon CV",
      "pathSkillsEnvironment": "Environnement",
      "company": "Entreprise : Predict",
      "pathSkillsLanguages": "Langues parlées",
      "french" : "Français - Natif",
      "english" : "Anglais - 840 TOEIC (B2)",
      "german" : "Allemand - A2",
      "Otherportfolio": "Portfolio de mes amis !",
      "ContentProjectsGoogleSheet1":"Au CESI, le temps alloué aux repas est extrêmement limité, ce qui ne laisse aucune marge pour perdre du temps à décider avec qui manger et où. Cette situation peut non seulement perturber la concentration des étudiants, mais aussi déranger ceux qui souhaitent travailler de manière productive. En tant que responsable de la restauration pour la promotion FISA A3, j'ai pris l'initiative de résoudre ce problème en proposant une solution astucieuse : l'utilisation d'un Google Sheet.",
      "ContentProjectsGoogleSheet2":"Le Google Sheet que j'ai créé permet aux étudiants de choisir facilement leur repas en un simple clic, ce qui leur évite de devoir se concerter avec leurs camarades. Grâce à cette feuille de calcul partagée, chaque étudiant peut indiquer son choix de repas, qui est alors visible pour tout le reste de la classe. j'ai intégré des graphiques pour visualiser les préférences alimentaires de la classe. Ces graphiques permettent à chacun de voir rapidement les options les plus populaires, facilitant ainsi la prise de décision. Cela permet d'éliminer les discussions chronophages et de rendre le processus de décision beaucoup plus rapide et efficace. De plus, j'ai également utilisé des scripts personnalisés pour automatiser certaines tâches. Par exemple, un script garantisant l'automatisation du processus de remise à zéro, ce qui facilite la gestion du Google Sheet.",
      "ContentProjectsGoogleSheet3":"En résumé, en proposant ce Google Sheet innovant, j'ai cherché à résoudre les problèmes de perte de temps et de concentration qui peuvent survenir lors de la prise des repas au CESI. Cette solution facilite le processus de choix des repas, permettant ainsi aux étudiants de profiter pleinement de leur temps de repas et de favoriser un environnement propice au travail et à la productivité. ",
      "personnel": "Personnel"

    },
    "en": {
      "title": "My Portfolio",
      "headerTitle": "My Portfolio",
      "titleAboutMe": "About Me",
      "aboutText": "Hello and welcome to my portfolio! I am a computer engineering student pursuing an alternate education path, passionate about technology. I am constantly seeking new opportunities to apply my skills and expand my knowledge. Within this portfolio, I share my projects, achievements, and professional experiences, which reflect my journey. Explore my work and discover how I have contributed to tangible projects, acquired new skills, and taken on exciting challenges. I am open to collaborations and learning opportunities, so feel free to contact me if you would like to learn more about my accomplishments or discuss potential projects. Thank you for visiting my portfolio, and I hope to have the opportunity to collaborate with you.",
      "titleProject": "My Projects",
      "contactTitle": "Contact",
      "languageButtonText": "English",
      "name": "Mathieu MAION",
      "email": "mathieu.maion0@gmail.com",
      "phone": "(+33) 6 15 80 45 34",
      "headerAboutMe": "About me",
      "headerProjects": "Projects",
      "headerPath": "Curriculum",
      "headerSkills": "Skills",
      "titlePath": "My curriculum",
      "titleSkills": "My skills",
      "pathInfoCESITitle": "CESI école d'ingénieurs",
      "pathInfoCESIFormation": "Computer engineer as work-study",
      "pathInfoCESICity": "France Vandœuvre-lès-Nancy, 6 Rue Bois du Chêne le Loup",
      "pathInfoCESIDesc": "Currently in computer engineering formation, I develop both advanced computer skills and expertise in team work. By specializing in areas such as programming, networking and computer security, I gain in-depth technical expertise. At the same time, the group projects in which I participate allow me to improve my interpersonal skills, such as communication, collaboration and team problem-solving, essential qualities for success in the field of computer engineering.",
      "pathInfoIUTTitle": "University institute of technology Nancy-Charlemagne",
      "pathInfoIUTFormation": "Computer science diploma specialized in mathematics for engineers",
      "pathInfoIUTCity": "France Nancy, 2Ter Bd Charlemagne",
      "pathInfoIUTDesc": "The computer science with a specialty in mathematics for engineering formation allowed me to develop in-depth computer skills and work effectively as a team. I have acquired expertise in areas such as programming, databases and software design, while collaborating with my peers on concrete projects. This experience has enabled me not only to strengthen my technical skills, but also to develop my communication, problem-solving and collaborative skills, which are essential in the professional world of IT.",
      "pathInfoPoincareTitle": "Highschool Henri Poincaré",
      "pathInfoPoincareFormation": "Scientific baccalaureate with mathematics specialization",
      "pathInfoPoincareCity":"France - Nancy, 2 rue de la visitation",
      "pathInfoPoincareDesc": "This formation has enabled me to develop the ability to work rigorously, analyze complex problems, and apply mathematical methods to solve real-life situations. These skills have proven valuable to me in various fields, including sciences, engineering, and computer science.",
      "pathSkillsWeb": "Web",
      "pathSkillsProgrammingLanguages": "Programmation languages",
      "pathSkillsDB": "Database",
      "CVText": "My resume",
      "pathSkillsEnvironment": "Environment",
      "company": "Company : Predict",
      "pathSkillsLanguages": "Spoken languages",
      "french" : "French - Natif",
      "english" : "English - 840 TOEIC (B2)",
      "german" : "German - A2",
      "Otherportfolio": "My friends portfolio !",
      "ContentProjectsGoogleSheet1":"At CESI, the allotted time for meals is extremely short, leaving no room to waste time deciding who to eat with and where. This situation not only disrupts students' concentration but also hampers those who wish to work productively. As the responsible person for food services in the FISA A3 cohort, I took the initiative to solve this problem by proposing a clever solution : using a Google Sheet.",
      "ContentProjectsGoogleSheet2":"The Google Sheet I created allows students to easily choose their meals with a simple click, eliminating the need for coordination with their peers. Through this shared spreadsheet, each student can indicate their meal choice, which is then visible to the entire class. I integrated graphs to visualize the class's food preferences. These graphs enable everyone to quickly see the most popular options, facilitating decision-making. This eliminates time-consuming discussions and makes the decision-making process much faster and more efficient. Additionally, I also utilized custom scripts to automate certain tasks, such as a script ensuring the automation of the reset process, which simplifies the management of the Google Sheet.",
      "ContentProjectsGoogleSheet3":"In summary, by offering this innovative Google Sheet, I aimed to solve the problems of time loss and decreased concentration that can occur during mealtime at CESI. This solution streamlines the meal selection process, allowing students to fully enjoy their mealtime and promoting an environment conducive to work and productivity.",
      "personnel": "Personal"

    }
  }
  
