{
  "fr": {
    "title": "Mon Portfolio",
    "headerTitle": "Mon Portfolio",
    "titleAboutMe": "À propos de moi",
    "aboutText1": "Bienvenue sur mon portfolio ! Je suis un étudiant en école d'ingénieur informatique en alternance, passionné par les nouvelles technologies et constamment à la recherche de nouvelles opportunités pour mettre en pratique mes compétences et développer mes connaissances. Au travers de ce portfolio, j'ai rassemblé mes projets, réalisations et expériences professionnelles afin de vous donner un aperçu de mon parcours et de mes compétences.",
    "aboutText2": "Découvrez à travers mon portfolio l'étendue de mes compétences et de mes réalisations en tant qu'étudiant en école d'ingénieur informatique en alternance. J'ai consacré du temps et de l'énergie à développer des projets concrets, mettant en pratique mes connaissances et compétences acquises au fil de mes études. Grâce à des projets variés allant du développement d'applications web à la résolution de problèmes complexes, j'ai pu renforcer mes compétences techniques et découvrir de nouvelles technologies.",
    "aboutText3": "Mon objectif est de proposer des solutions innovantes et efficaces en utilisant des langages de programmation tels que Java, Python et JavaScript, ainsi que des frameworks et des outils modernes. J'ai également une solide expérience dans les technologies web comme HTML, CSS et les bases de données. Mon approche est axée sur la résolution de problèmes et l'amélioration continue, cherchant toujours à apprendre de nouvelles technologies et à relever de nouveaux défis.",
    "aboutText4": "N'hésitez pas à explorer mon portfolio pour découvrir certains de mes projets marquants et à me contacter si vous souhaitez en savoir plus ou discuter de collaborations potentielles. Je suis ouvert aux opportunités d'apprentissage et de collaboration, prêt à contribuer à des projets passionnants dans le domaine de l'informatique.",
    "titleProject": "Mes projets",
    "contactTitle": "Contact",
    "languageButtonText": "Français",
    "name": "Mathieu MAION",
    "email": "mathieu.maion0@gmail.com",
    "phone": "06 15 80 45 34",
    "headerAboutMe": "À propos de moi",
    "headerProjects": "Projets",
    "headerPath": "Parcours",
    "headerSkills": "Compétences",
    "titlePath": "Mon parcours",
    "titleSkills": "Mes compétences",
    "pathInfoCESITitle": "CESI école d'ingénieurs",
    "pathInfoCESIFormation": "Ingénieur informatique en alternance",
    "pathInfoCESICity": "Vandœuvre-lès-Nancy, 6 Rue Bois du Chêne le Loup",
    "pathInfoCESIDesc": "Actuellement en formation d'ingénieur en informatique, je développe à la fois des compétences avancées en informatique et une expertise en travail d'équipe. En me spécialisant dans des domaines tels que la programmation, les réseaux et la sécurité informatique, j'acquiers une expertise technique approfondie. Parallèlement, les projets de groupe auxquels je participe me permettent d'améliorer mes compétences interpersonnelles, telles que la communication, la collaboration et la résolution de problèmes en équipe, des qualités essentielles pour réussir dans le domaine de l'ingénierie informatique.",
    "pathInfoIUTTitle": "IUT Nancy-Charlemagne",
    "pathInfoIUTFormation": "DUT informatique spécialité mathématique pour l'ingénieur",
    "pathInfoIUTCity": "Nancy, 2Ter Bd Charlemagne",
    "pathInfoIUTDesc": "La formation en DUT Informatique avec une spécialité en mathématiques pour l'ingénieur m'a permis de développer des compétences approfondies en informatique et de travailler de manière efficace en équipe. J'ai acquis une expertise dans des domaines tels que la programmation, les bases de données et la conception de logiciels, tout en collaborant avec mes pairs sur des projets concrets. Cette expérience m'a non seulement permis de renforcer mes compétences techniques, mais aussi de développer mes compétences en communication, en résolution de problèmes et en collaboration, qui sont essentielles dans le monde professionnel de l'informatique.",
    "pathInfoPoincareTitle": "Lycée Henri Poincaré",
    "pathInfoPoincareFormation": "Baccalauréat scientifique spécialité mathématique",
    "pathInfoPoincareCity": "Nancy, 2 rue de la visitation",
    "pathInfoCompany": "Compagnie : PREDICT",
    "pathInfoPoincareDesc": "Cette formation m'a permis d'obtenir une capacité à travailler avec rigueur, à analyser des problèmes complexes et à utiliser des méthodes mathématiques pour résoudre des situations concrètes. Ces compétences m'ont été précieuses dans de nombreux domaines, tels que les sciences, l'ingénierie et l'informatique. ",
    "pathSkillsWeb": "Web",
    "pathSkillsProgrammingLanguages": "langages de programmation",
    "pathSkillsDB": "Base de données",
    "CVText": "Mon CV",
    "pathSkillsEnvironment": "Environnement",
    "company": "Entreprise : Predict",
    "pathSkillsLanguages": "Langues parlées",
    "french": "Français - Natif",
    "english": "Anglais - 840 TOEIC (B2)",
    "german": "Allemand - A2",
    "Otherportfolio": "Portfolio de mes amis",
    "ContentProjectsGoogleSheet1": "Au CESI, le temps alloué aux repas est extrêmement limité, ce qui ne laisse aucune marge pour perdre du temps à décider avec qui manger et où. Cette situation peut non seulement perturber la concentration des étudiants, mais aussi déranger ceux qui souhaitent travailler de manière productive. En tant que responsable de la restauration pour la promotion FISA A3, j'ai pris l'initiative de résoudre ce problème en proposant une solution astucieuse : l'utilisation d'un Google Sheet.",
    "ContentProjectsGoogleSheet2": "Le Google Sheet que j'ai créé permet aux étudiants de choisir facilement leur repas en un simple clic, ce qui leur évite de devoir se concerter avec leurs camarades. Grâce à cette feuille de calcul partagée, chaque étudiant peut indiquer son choix de repas, qui est alors visible pour tout le reste de la classe. j'ai intégré des graphiques pour visualiser les préférences alimentaires de la classe. Ces graphiques permettent à chacun de voir rapidement les options les plus populaires, facilitant ainsi la prise de décision. Cela permet d'éliminer les discussions chronophages et de rendre le processus de décision beaucoup plus rapide et efficace. De plus, j'ai également utilisé des scripts personnalisés pour automatiser certaines tâches. Par exemple, un script garantisant l'automatisation du processus de remise à zéro, ce qui facilite la gestion du Google Sheet.",
    "ContentProjectsGoogleSheet3": "En plus de la solution du Google Sheet pour la sélection des repas, j'ai également mis en place une fonctionnalité qui permet aux étudiants d'accéder à l'historique des choix de repas des semaines précédentes. Cette fonctionnalité offre non seulement un moyen pratique de consulter les préférences passées, mais permet également de générer des statistiques précieuses.",
    "ContentProjectsGoogleSheet4": "En conservant un enregistrement continu des sélections de repas, nous pouvons suivre les tendances et les schémas dans les choix faits par la classe. Ces données historiques offrent des informations sur les préférences du groupe et permettent d'analyser les habitudes alimentaires. Grâce à la consultation de l'historique, les étudiants peuvent prendre des décisions éclairées en se basant sur les choix précédents. De plus, cela facilite l'identification des plats populaires et des préférences communes, ce qui peut aider à mieux planifier les menus à l'avenir.",
    "ContentProjectsGoogleSheet5": "De plus, l'historique permet également de faire respecter les règles et le code de conduite de l'Excel. Il assure que chacun se conforme aux directives et aux normes établies. Les écarts ou les violations peuvent être identifiés, ce qui peut entraîner des actions ou des sanctions appropriées selon",
    "ContentProjectsGoogleSheet6": "En résumé, en proposant ce Google Sheet innovant, j'ai cherché à résoudre les problèmes de perte de temps et de concentration qui peuvent survenir lors de la prise des repas au CESI. Cette solution facilite le processus de choix des repas, permettant ainsi aux étudiants de profiter pleinement de leur temps de repas et de favoriser un environnement propice au travail et à la productivité. ",
    "ExcelCode": "le code de L'Excel",
    "personnel": "Personnel",
    "contactControl": "Contrôle",
    "pathSkillsNonTechnical": "Compétences non-techniques",
    "teamWorking": "Travail en équipe",
    "communication": "Communication",
    "problemSolving": "Résolution de problèmes",
    "pathInfoPREDICTFormation": "Développeur apprenti en alternance",
    "pathInfoPREDICTCity": "Vandœuvre-lès-Nancy, 19 Avenue de la Forêt de Haye",
    "pathInfoPREDICTDesc": "En tant que développeur en alternance, je suis pleinement engagé dans l'apprentissage et le développement de compétences pratiques au sein d'une entreprise dynamique. J'ai l'opportunité de travailler aux côtés d'une équipe expérimentée pour concevoir, développer et mettre en œuvre des solutions logicielles innovantes. Mon rôle consiste à contribuer au développement d'applications informatiques, en utilisant des langages de programmation tels que C#, java, HTML, JS, et CSS. Grâce à cette expérience en alternance, je renforce mes compétences techniques tout en me familiarisant avec les meilleures pratiques de développement logiciel, la collaboration en équipe et la résolution de problèmes concrets."
  },
  "en": {
    "title": "My Portfolio",
    "headerTitle": "My Portfolio",
    "titleAboutMe": "About Me",
    "aboutText1": "Welcome to my portfolio ! I am a student pursuing a master degree in computer engineering through an apprenticeship program. I am passionate about emerging technologies and constantly seeking new opportunities to apply my skills and expand my knowledge. Within this portfolio, I have gathered my projects, achievements, and professional experiences to provide you with an overview of my journey and competencies.",
    "aboutText2": "Explore my portfolio to discover the breadth of my skills and accomplishments as a student in a computer engineering apprenticeship program. I have dedicated time and effort to develop tangible projects, putting into practice the knowledge and skills I have acquired throughout my studies. Through a range of projects, from web application development to tackling complex problem-solving, I have been able to enhance my technical abilities and explore new technologies.",
    "aboutText3": "My goal is to deliver innovative and efficient solutions using programming languages such as Java, Python, and JavaScript, along with modern frameworks and tools. I also possess a strong background in web technologies such as HTML, CSS, and databases. My approach centers around problem-solving and continuous improvement, always seeking to learn new technologies and take on new challenges.",
    "aboutText4": "Feel free to explore my portfolio to discover some of my notable projects, and don't hesitate to reach out if you would like to learn more or discuss potential collaborations. I am open to learning opportunities and collaborations, ready to contribute to exciting projects in the field of computer engineering.",
    "titleProject": "My Projects",
    "contactTitle": "Contact",
    "languageButtonText": "English",
    "name": "Mathieu MAION",
    "email": "mathieu.maion0@gmail.com",
    "phone": "(+33) 6 15 80 45 34",
    "headerAboutMe": "About me",
    "headerProjects": "Projects",
    "headerPath": "Curriculum",
    "headerSkills": "Skills",
    "titlePath": "My curriculum",
    "titleSkills": "My skills",
    "pathInfoCESITitle": "CESI école d'ingénieurs",
    "pathInfoCESIFormation": "Master degree in computer engineer as work-study",
    "pathInfoCESICity": "France, Vandœuvre-lès-Nancy, 6 Rue Bois du Chêne le Loup",
    "pathInfoCESIDesc": "Currently in computer engineering training, I develop both advanced computer skills and expertise in team work. By specializing in areas such as programming, networking and computer security, I gain in-depth technical expertise. At the same time, the group projects in which I participate allow me to improve my interpersonal skills, such as communication, collaboration and team problem-solving, essential qualities for success in the field of computer engineering.",
    "pathInfoIUTTitle": "University institute of technology Nancy-Charlemagne",
    "pathInfoIUTFormation": "Computer science diploma specialized in mathematics for engineers",
    "pathInfoIUTCity": "France, Nancy, 2Ter Bd Charlemagne",
    "pathInfoIUTDesc": "The computer science with a specialty in mathematics for engineering training allowed me to develop in-depth computer skills and work effectively as a team. I have acquired expertise in areas such as programming, databases and software design, while collaborating with my peers on concrete projects. This experience has enabled me not only to strengthen my technical skills, but also to develop my communication, problem-solving and collaborative skills, which are essential in the professional world of IT.",
    "pathInfoPoincareTitle": "Highschool Henri Poincaré",
    "pathInfoPoincareFormation": "Scientific baccalaureate with mathematics specialization",
    "pathInfoPoincareCity": "France, Nancy, 2 rue de la visitation",
    "pathInfoCompany": "Company: PREDICT",
    "pathInfoPoincareDesc": "This training has enabled me to develop the ability to work rigorously, analyze complex problems, and apply mathematical methods to solve real-life situations. These skills have proven valuable to me in various fields, including sciences, engineering, and computer science.",
    "pathSkillsWeb": "Web",
    "pathSkillsProgrammingLanguages": "Programmation languages",
    "pathSkillsDB": "Database",
    "CVText": "My resume",
    "pathSkillsEnvironment": "Environment",
    "company": "Company : Predict",
    "pathSkillsLanguages": "Spoken languages",
    "french": "French - Native",
    "english": "English - 840 TOEIC (B2)",
    "german": "German - A2",
    "Otherportfolio": "My friends portfolio",
    "ContentProjectsGoogleSheet1": "At CESI, the allotted time for meals is extremely short, leaving no room to waste time deciding who to eat with and where. This situation not only disrupts students' concentration but also hampers those who wish to work productively. As the responsible person for food services in the FISA A3 cohort, I took the initiative to solve this problem by proposing a clever solution : using a Google Sheet.",
    "ContentProjectsGoogleSheet2": "The Google Sheet I created allows students to easily choose their meals with a simple click, eliminating the need for coordination with their peers. Through this shared spreadsheet, each student can indicate their meal choice, which is then visible to the entire class. I integrated graphs to visualize the class's food preferences. These graphs enable everyone to quickly see the most popular options, facilitating decision-making. This eliminates time-consuming discussions and makes the decision-making process much faster and more efficient. Additionally, I also utilized custom scripts to automate certain tasks, such as a script ensuring the automation of the reset process, which simplifies the management of the Google Sheet.",
    "ContentProjectsGoogleSheet3": "In addition to the Google Sheet solution for meal selection, I have also implemented a feature that allows students to access the history of previous weeks' meal choices. This feature not only provides a convenient way to review past preferences but also allows for valuable statistical analysis.",
    "ContentProjectsGoogleSheet4": "By maintaining a continuous record of meal selections, we can track trends and patterns in the choices made by the class. This historical data offers insights into the group's preferences and enables the analysis of eating habits. By consulting the history, students can make informed decisions based on past choices. Additionally, it facilitates the identification of popular dishes and common preferences, which can aid in better menu planning in the future.",
    "ContentProjectsGoogleSheet5": "Additionally, the history feature also helps enforce the rules and code of conduct of the Excel. It ensures that everyone adheres to the established guidelines and standards. Deviations or violations can be identified, which may result in appropriate actions or sanctions in accordance with ",
    "ContentProjectsGoogleSheet6": "In summary, by offering this innovative Google Sheet, I aimed to solve the problems of time loss and decreased concentration that can occur during mealtime at CESI. This solution streamlines the meal selection process, allowing students to fully enjoy their mealtime and promoting an environment conducive to work and productivity.",
    "ExcelCode": "the Excel code",
    "personnel": "Personal",
    "contactControl": "Control",
    "pathSkillsNonTechnical": "Non-technical skills",
    "teamWorking": "Team working",
    "communication": "Communication",
    "problemSolving": "Problems solving",
    "pathInfoPREDICTFormation": "Work-study apprentice developer",
    "pathInfoPREDICTCity": "France Vandœuvre-lès-Nancy, 19 Avenue de la Forêt de Haye",
    "pathInfoPREDICTDesc": "As an apprentice developer, I am fully committed to learning and developing practical skills within a dynamic company. I have the opportunity to work alongside an experienced team to design, develop, and implement innovative software solutions. My role involves contributing to the development of computer applications using programming languages such as C#, Java, HTML, JS, and CSS. Through this apprenticeship experience, I am strengthening my technical skills while becoming familiar with best software development practices, team collaboration, and solving real-world problems."
  }
  }
  
